In [1]:
import pandas as pd
import numpy as np
from word2number import w2n
from sklearn import linear_model

In [2]:
df1 = pd.read_csv('homeprices2.csv')
df1

   area  bedrooms  years   price
0  2600       3.0     20  550000
1  3000       4.0     15  565000
2  3200       NaN     18  610000
3  3600       3.0     30  595000
4  4000       5.0      8  670000

In [3]:
import math
median_bedrooms = math.floor(df1.bedrooms.median())
median_bedrooms

3

In [4]:
df1.bedrooms=df1.bedrooms.fillna(median_bedrooms)
df1

   area  bedrooms  years   price
0  2600       3.0     20  550000
1  3000       4.0     15  565000
2  3200       3.0     18  610000
3  3600       3.0     30  595000
4  4000       5.0      8  670000

In [5]:
reg = linear_model.LinearRegression()
reg.fit(df1[['area', 'bedrooms', 'years']], df1.price)

LinearRegression()

In [6]:
reg.coef_

array([    99., -36600.,  -4800.])

In [7]:
reg.intercept_

492399.9999999997

In [8]:
reg.predict([[3000, 3, 40]])

C:\Users\mansh\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([487600.])

In [9]:
# price= m1*area + m2*bedrooms + m3*years + intercept
99*3000 + -36600.*3 + -4800.*40 + 492399.9999999997

487599.9999999997

In [10]:
reg.predict([[2500, 4, 5]])

C:\Users\mansh\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([569500.])

In [11]:
df2 = pd.read_csv('hiring.csv')
df2

  experience  test_score  interview_score  salary $
0        NaN         8.0                9     50000
1        NaN         8.0                6     45000
2       five         6.0                7     60000
3        two        10.0               10     65000
4     seven          9.0                6     70000
5      three         7.0               10     62000
6        ten         NaN                7     72000
7     eleven         7.0                8     80000

In [12]:
import math
median_test_score = math.floor(df2.test_score.median())
median_test_score

8

In [13]:
df2.test_score = df2.test_score.fillna(median_test_score)
df2

  experience  test_score  interview_score  salary $
0        NaN         8.0                9     50000
1        NaN         8.0                6     45000
2       five         6.0                7     60000
3        two        10.0               10     65000
4     seven          9.0                6     70000
5      three         7.0               10     62000
6        ten         8.0                7     72000
7     eleven         7.0                8     80000

In [23]:

l

[nan, nan, 'five', 'two', 'seven ', 'three', 'ten', 'eleven']

In [25]:
# num_list = [w2n.word_to_num(word) for word in l]
# print(num_list)